willbearfruits/esp32-s3-supermini-kit/firmware/sdkconfig.defaults
# ESP32-S3 SuperMini (ESP32-S3FH4R2: 4 MB flash, 2 MB PSRAM)
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_COMPILER_OPTIMIZATION_PERF=y

# The SuperMini's USB-C goes straight to the S3's native USB.
# Route the console through USB Serial/JTAG so `idf.py monitor` just works.
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
CONFIG_ESP_CONSOLE_UART_DEFAULT=n

# TinyUSB (only used when KIT_USB_MIDI is on, see sdkconfig.defaults.usbmidi)
CONFIG_TINYUSB_CDC_ENABLED=y
CONFIG_TINYUSB_MIDI_COUNT=1
CONFIG_TINYUSB_DESC_USE_ESPRESSIF_VID=y
CONFIG_TINYUSB_DESC_USE_DEFAULT_PID=y
CONFIG_TINYUSB_DESC_MANUFACTURER_STRING="ESP32-S3 Kit"
CONFIG_TINYUSB_DESC_PRODUCT_STRING="Kit Voice Instrument"

# 2 MB embedded quad PSRAM (ESP32-S3FH4R2). Holds the looper's vocal loop.
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_QUAD=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_IGNORE_NOTFOUND=y
